tutorials/incompressibleVoF/trayedPipe/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

alphaMean       0.25;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "blockMeshDict"

defaultValues
{
    alpha.water 0;
}

zones
{
    water
    {
        type        cylinder;

        point1  (0 0 0);
        point2  (0 $height 0);
        radius  #calc "$<scalar>radius*sqrt($<scalar>alphaMean)";

        values
        {
            alpha.water 1;
        }
    }
}

// ************************************************************************* //
